#+TITLE: J Sandbox
#+STARTUP: inlineimages
#+options: toc:2
#+last_modified: 2024-12-30 23:44:41 alex

* Table of contents                                                     :TOC:
- [[#heads-and-tails][Heads and tails]]
- [[#indices][Indices]]
- [[#sets][Sets]]
  - [[#difference][Difference]]
  - [[#element][Element]]
- [[#select][Select]]
- [[#modify][Modify]]
- [[#sort][Sort]]
- [[#rotate][Rotate]]
- [[#gerund][Gerund]]
- [[#org-configuration][org-configuration]]

* Heads and tails
#+begin_src j
  ({. ; }. ; }: ;{:) i.4
#+end_src
#+RESULTS:
: ┌─┬─────┬─────┬─┐
: │0│1 2 3│0 1 2│3│
: └─┴─────┴─────┴─┘
#+begin_src j
  2 ({. ; }.) i.5
#+end_src

#+RESULTS:
: ┌───┬─────┐
: │0 1│2 3 4│
: └───┴─────┘
#+begin_src j
  6 ({. ; }.) i.4
#+end_src

#+RESULTS:
: ┌───────────┬┐
: │0 1 2 3 0 0││
: └───────────┴┘

* Indices
#+begin_src j
   1 0 1 0 0 0 # 3 1 4 1 5 9
#+end_src

#+RESULTS:
: 3 4

Finds the first occurrence of =y= in =x=
https://code.jsoftware.com/wiki/Vocabulary/idot#dyadic
#+begin_src j
   3 1 4 1 5 9 i. 5
#+end_src

#+RESULTS:
: 4

Several elements to search
#+begin_src j
   3 1 4 1 5 9 i. i.5
#+end_src

#+RESULTS:
: 6 1 6 0 2

=#x= if not found
#+begin_src j
   10 2 i. 2 5
#+end_src

#+RESULTS:
: 1 2

Use the search results as indices in another array and return a default value if not found
#+begin_src j
  (10 2 i. 2 5) { (22 33), 100
#+end_src

#+RESULTS:
: 33 100

Indices of all 1s in a Boolean list
https://code.jsoftware.com/wiki/Vocabulary/icapdot
#+begin_src j
   I. 3 2 4 5 > 4 1 9 3
#+end_src

#+RESULTS:
: 1 3

Index of the interval of a sorted list =x= in which =y= lies
#+begin_src j
  (i.10) I. 2.5 7.3 5
#+end_src

#+RESULTS:
: 3 8 5

* Sets
** Difference
#+begin_src j
   1 2 3 4 5 4 3 -. 2 4
#+end_src

#+RESULTS:
: 1 3 5 3
** Element
#+begin_src j
  (2 e. i.5) ; 10 e. i.5
#+end_src

#+RESULTS:
: ┌─┬─┐
: │1│0│
: └─┴─┘

* Select
#+begin_src j
  1 3 { i.5
#+end_src

#+RESULTS:
: 1 3

#+begin_src j
  (1 + i.3) { i.5
#+end_src

#+RESULTS:
: 1 2 3

Select rows
#+begin_src j
  0 2 { i. 3 4
#+end_src

#+RESULTS:
: 0 1  2  3
: 8 9 10 11

#+begin_src j
  0 0 { i. 3 4
#+end_src

#+RESULTS:
: 0 1 2 3
: 0 1 2 3

Row/column
#+begin_src j
  (<0 ; 2) { i. 3 4
#+end_src

#+RESULTS:
: 2

Several elements by row/columt
#+begin_src j
  (0 2 ; 2 3) { i. 3 4
#+end_src

#+RESULTS:
: 2 11

Elements at intersection of rows and columns
#+begin_src j
  (<0 2 ; 0 3) { i. 3 4
#+end_src

#+RESULTS:
: 0  3
: 8 11

#+begin_src j
  (< 0; (2 + i.2)) { i. 3 4
#+end_src

#+RESULTS:
: 2 3

* Modify
#+begin_src j
100 (0 0 ; 1 1) } i.2 2
#+end_src

#+RESULTS:
: 100   1
:   2 100

* Sort
#+begin_src j
  1 3 6 i.7
#+end_src

#+RESULTS:
: 3

* Rotate
#+begin_src j
  _2 |.     1, 5 $ 0
#+end_src

#+RESULTS:
: 0 0 1 0 0 0

Identity matrix
(https://code.jsoftware.com/wiki/Essays/Identity_Matrix#Rotate)
#+begin_src j
  (-@i. |."0 1 {.&1) 5
#+end_src

#+RESULTS:
: 1 0 0 0 0
: 0 1 0 0 0
: 0 0 1 0 0
: 0 0 0 1 0
: 0 0 0 0 1

#+begin_src j
  (-i.6) |."0"1 1, 5 $ 0
#+end_src

#+RESULTS:
: |length error, executing dyad |."0
: |shapes 6 and 5 do not conform
: |   (-i.6)    |."0"1 1,5$0

* Gerund
https://code.jsoftware.com/wiki/Help/Learning/Ch_14:_Gerunds
#+begin_src j
  +/`#`{:`:0 i.5
#+end_src

#+RESULTS:
: 10 5 4

* org-configuration
#+STARTUP: align fold nodlcheck hidestars oddeven lognotestate
#+OPTIONS: ^:nil
#+property: header-args:emacs-lisp :results silent
#+property: header-args:j :session *J* results verbatim
# Local Variables:
# eval: (add-hook 'before-save-hook 'time-stamp nil t)
# time-stamp-active: t
# End:
